In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('file1.txt')

In [3]:
df

   q  r  s  t   apple
0  a  b  c  d  banana
1  e  f  g  h   pines
2  r  e  w  d   mango

In [4]:
df = pd.read_csv('file1.txt', header=None)

In [5]:
df

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d  banana
2  e  f  g  h   pines
3  r  e  w  d   mango

In [6]:
df = pd.read_table('file1.txt')

In [7]:
df

    q,r,s,t,apple
0  a,b,c,d,banana
1   e,f,g,h,pines
2   r,e,w,d,mango

In [8]:
df = pd.read_table('file1.txt', header=None, sep=',')

In [9]:
df

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d  banana
2  e  f  g  h   pines
3  r  e  w  d   mango

In [10]:
df = pd.read_csv('file1.txt', header=None, nrows=2)

In [11]:
df

   0  1  2  3       4
0  q  r  s  t   apple
1  a  b  c  d  banana

In [12]:
import sys

In [17]:
df.to_csv(sys.stdout, columns=[1,3,4])

,1,3,4
0,r,t,apple
1,b,d,banana